tutorials/HeatTransfer/UBend/run/system/fvSchemes
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes 
{
    default                                             steadyState;
}

ddtSchemes 
{
    default                                             steadyState;
}

gradSchemes
{
    default                                             Gauss linear;
    grad(U)                                             cellLimited Gauss linear 1.000000;
    grad(nuTilda)                                       cellLimited Gauss linear 1.000000;
}

divSchemes
{
    default                                             none;
    div(phi,U)                                          bounded Gauss linearUpwindV grad(U);
    div(phi,nuTilda)                                    bounded Gauss upwind;
    div(phi,T)                                          bounded Gauss upwind;
    div(pc)                                             bounded  Gauss upwind;
    div(phi,omega)                                      bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))                       Gauss linear;
    div(phi,k)                                          bounded Gauss upwind;
}

interpolationSchemes
{
    default                                             linear;
}

laplacianSchemes
{
    default                                             Gauss linear  corrected;
}

snGradSchemes
{
    default                                             corrected ;
}

fluxRequired
{
    default                                             no;
    p;
    p_rgh;
    Phi;
}

wallDist
{
    method                                              meshWave;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
