tutorials/HeatTransfer/UBend/run/system/adjointDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      adjointDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

flowOptions
{
    flowCondition          Incompressible;
    setFlowBCs             false;
    flowBCs                { useWallFunction false; bc4 {patch inlet; variable epsilon; value (42.0);} bc5 {patch inlet; variable nuTilda; value (0.00015);} bc6 {patch inlet; variable T; value (293.15);} bc0 {patch inlet; variable U; value (8.4 0.0 0.0);} bc1 {patch outlet; variable p; value (0.0);} bc2 {patch inlet; variable k; value (0.265);} bc3 {patch inlet; variable omega; value (1764.0);} }
    inletPatches           (inlet);
    outletPatches          (outlet);
    derivUInInfo           {stateName U; component 0; type fixedValue;patchNames (inlet ); }
    userDefinedPatchInfo   { }
    userDefinedVolumeInfo  { }
    referenceValues        (ARef 1.000000e+00 magURef 8.400000e+00 pRef 0.000000e+00 rhoRef 1.000000e+00 LRef 7.500000e-02 );
    divDev2                true;
    useNKSolver            false;
    nkSegregatedTurb       false;
    nkSegregatedPhi        false;
    nkRelTol               1.000000e-08;
    nkAbsTol               1.000000e-12;
    nkSTol                 1.000000e-08;
    nkEWRTol0              0.300000;
    nkEWRTolMax            0.700000;
    nkPCLag                1;
    nkMaxIters             100;
    nkMaxFuncEvals         10000;
    nkASMOverlap           1;
    nkGlobalPCIters        0;
    nkLocalPCIters         1;
    nkPCFillLevel          0;
    nkJacMatReOrdering     rcm;
    nkGMRESMaxIters        500;
    nkGMRESRestart         500;
}

adjointOptions
{
    solveAdjoint           true;
    useColoring            true;
    normalizeResiduals     (URes pRes p_rghRes phiRes kRes omegaRes nuTildaRes epsilonRes TRes GRes);
    normalizeStates        (U p p_rgh phi k omega nuTilda T epsilon G);
    nFFDPoints             0;
    correctWallDist        true;
    reduceResCon4JacMat    false;
    calcPCMat              true;
    fastPCMat              false;
    delTurbProd4PCMat      false;
    writeMatrices          false;
    adjGMRESMaxIters       1500;
    adjGMRESRestart        1500;
    adjASMOverlap          1;
    adjJacMatOrdering      state;
    adjJacMatReOrdering    rcm;
    adjGlobalPCIters       0;
    adjLocalPCIters        1;
    adjPCFillLevel         2;
    adjGMRESRelTol         1.000000e-05;
    adjGMRESAbsTol         1.000000e-16;
    minTolJac              1.000000e-14;
    maxTolJac              1.000000e+14;
    minTolPC               1.000000e-14;
    maxTolPC               1.000000e+14;
    stateResetTol          1.000000e-06;
    tractionBCMaxIter      20;
    epsDeriv               1.000000e-06;
    epsDerivFFD            1.000000e-05;
    epsDerivXv             1.000000e-07;
    epsDerivUIn            1.000000e-05;
    epsDerivVis            1.000000e-08;
    stateScaling           ( UScaling 8.4 nuTildaScaling 0.0015 kScaling 0.265 TScaling 293.15 GScaling 1000.0 epsilonScaling 42.0 omegaScaling 1764.0 p_rghScaling 32.0 phiScaling 1.0 pScaling 32.0);
    residualScaling        ();
    maxResConLv4JacPCMat   ( URes 2 kRes 2 p_rghRes 2 epsilonRes 2 phiRes 1 nuTildaRes 2 TRes 2 GRes 2 omegaRes 2 pRes 2);
    adjDVTypes             (FFD);
}

actuatorDiskOptions
{
    actuatorActive         0;
    actuatorAdjustThrust   0;
    actuatorVolumeNames    ();
    actuatorThrustCoeff    ();
    actuatorPOverD         ();
    actuatorRotationDir    ();
}

objectiveFunctionOptions
{
    objFuncs               (NUS);
    objFuncGeoInfo         (  (ubend) );
    dragDir                (1.0000000000 0.0000000000 0.0000000000 );
    liftDir                (0.0000000000 0.0000000000 1.0000000000 );
    CofR                   (0.0000000000 0.0000000000 0.0000000000 );
    rotRad                 (0.0000000000 0.0000000000 0.0000000000 );
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
